#include "source.h"
/*
ПРАКТИЧНЕ ЗАВДАННЯ
Під час виконання даного практичного завдання потрібно:
+створити проект, в якому в окремих файлах будуть знаходитись завдання № 1 та № 2;
+створити власний заголовний файл, інформацію з якого будуть використовувати інші файли проекту;
+під час розв’язання завдання № 1 слід використовувати змінні зі специфікатором static (без використання масиву);
+під час розв’язання завдання № 2 слід використовувати макровизначення та іменовані константи.
Варіант № 1
Завдання 1. Обчисліть середнє арифметичне двадцяти цілих чисел, згенерованих рандомно.
Завдання 2. Знайдіть площі круга та прямокутника, а також об’єм прямокутної призми.
*/
void main () 
{
	setlocale(LC_ALL, "Rus");
	srand(time(NULL));
	int vibor = 0;
	do 
	{
		SLASH;
		printf_s("Какое задание хотите проверить?(1 or 2)\nВыход 0.\n");
		scanf_s("%d", &vibor);
		
		if (vibor == 0)
			break;
		else if (vibor == 1)
			zavdannya1();
		else if (vibor == 2)
			zavdannya2();
		else;
	} 
	while (1);

	for (int o = 0;o < 50;o++)
		printf_s("Завершение работы. ");
	puts("");
}