format PE64 console
entry start
section '.data' data writable
size = 8
source dq 0001010001000100h, 0101010000000000h, 0100010100010101h,0101010101000101h, 0100000101010001h, 0001000101000101h,0101010100000000h, 0000000001010101h, 0000000100000000h,0001010001000100h, 0101010000000000h
number dq (number-source)/size ;кількість даних в source
mask1 dq 0000000100000000h ; маска 32 розряду
mask2 dq 0000000001000000h ; маска 40 розряду
mask3 dq 0000000000010000h ; маска 24 розряду

section '.text' code executable
start:
xor rbx,rbx ;Лічильник даних, які зазнали маскування = 0
mov rdx,source ;В RDX адреса, з якої починається масив даних
mov rcx,[number] ;Завантаження лічильника циклів

m1:
mov rax,[rdx] ;Завантаження акумулятора з адреси в RDX
test rax,[mask1] ;Тестування 48-го розряду
jnz m2 ;Перехід якщо у 48-му розряді немає 0
test rax,[mask2] ;Тестування 32-го розряду
jz m2 ;Перехід на М2, якщо ZF = 1 (32-й розряд = 0)
test rax,[mask3] ;Тестування 16-го розряду
jnz m2 ;Перехід якщо у 16-му розряді немає 0
inc rbx ;Інкремент лічильника даних
m2:
add rdx,size ;Перехід до наступної адреси пам'яті даних
dec rcx ;Зменшення на 1 вмісту лічильника циклів
jnz m1 ;Перехід на М1, якщо ZF = 0 (не усі дані)