let N = '',L = '';

function vod()
{
let prov = 1;
 //Використання циклу для повторного вводу значення, якщо воно було введено не правильно
 while(prov != 0){
	N = prompt("Введіть значення N до поля форми і натисніть кнопку 'OK'");
	//Перевірка на пусте поле форми,символи та букви, а також на нуль та від'ємне число
	if(N == '' || isNaN(N) != 0 || N <= 0)
	{
	alert("Введіть верхню границю параметру зовнішнього циклу N, як ціле не від'ємне число, яке не повинно дорівнювати 0.");
	}
	else if(N > 0)
	{
	prov = 0;
	}
 }
 prov = 1;
 while(prov != 0){
	L = prompt("Введіть значення L до поля форми і натисніть кнопку 'OK'");
	//Перевірка на пусте поле форми,символи та букви, а також на нуль та від'ємне число
	if(L == '' || isNaN(L) != 0 || L <= 0)
	{
	alert("Введіть верхню границю параметру внутрішнього циклу L, як ціле не від'ємне число, яке не повинно дорівнювати 0.");
	}
	else if(L > 0)
	{
	prov = 0;
	}
 }
}
function cickl()
{

	if(N == '' || N == 0 || L == '' || L == 0)
	{
	alert("Введіть верхню границю параметрів зовнішнього і внутрішнього циклів");
	}
	else
	{
           let t1, t2, tc, tin, i = 0, j = 0;
	   t1 = new Date().getTime();
	   for(;i < N; i++)   
	   { 
              for(;j < L; j++)
	      {
                let y; 
		let x; 
		let a=0;
		y = Math.sin(Math.PI/3);
		y = y.toFixed(3);
		x = y + Math.log(10);
		if(a < 0){x=Math.sin(Math.PI/6);}
		else{x = Math.exp(-2);};
              }
           }
	   t2 = new Date().getTime();
	   tc = t2 - t1;
           if(tc == 0)
           {
           alert("Час виконання циклу менший за 1 мілісекунд.");
           }
           else if(tc != 0)
           {
           tin = tc/(N*L);
           tin = tin * 1000000;
           alert("Час виконання оператора(ів) тіла циклу: "+tin.toFixed(3)+" нс.");
           }
	}
}